Билет8/Documents/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>Бюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бюджет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатьиЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимоеПревышение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет8/AccumulationRegisters/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>Бюджет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимоеПревышение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет8/Documents/Бюджет/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если КонецПериода <= НачалоПериода Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Конец периода меньше или равен началу периода!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	// чтобы схема корректно работала для случаев, когда бюджет задаётся больше чем на месяц
	// бюджет нужно будет поделить по периоду (месяц)
	Движения.Бюджет.Записывать = Истина;
	
	ДлинаПериодаБюджета = (ДеньГода(КонецПериода) - ДеньГода(НачалоПериода)) + 1;
	
	Для Каждого ТекСтрокаСтатьиЗатрат Из СтатьиЗатрат Цикл
		
		лНачалоОтрезка = НачалоПериода;
		лКонецОтрезка = МИН(КонецПериода, КонецМесяца(НачалоПериода));
		
		ПериодКРаспределению = ДлинаПериодаБюджета;
		
		СуммаКРаспределению = ТекСтрокаСтатьиЗатрат.СуммаПлан;
		ДопустимоеПревышениеКРаспределению = ТекСтрокаСтатьиЗатрат.ДопустимоеПревышение;
		
		Пока СуммаКРаспределению <> 0 Цикл
			
			ДлинаОтрезка = (ДеньГода(лКонецОтрезка) - ДеньГода(лНачалоОтрезка)) + 1;
			
			СуммаПланОтрезка = ?(лКонецОтрезка = КонецПериода, СуммаКРаспределению, ДлинаОтрезка / ПериодКРаспределению * СуммаКРаспределению);
				
			ДопустимоеПревышениеОтрезка = ?(лКонецОтрезка = КонецПериода, ДопустимоеПревышениеКРаспределению, ДлинаОтрезка / ПериодКРаспределению * ДопустимоеПревышениеКРаспределению);
				
			Движение = Движения.Бюджет.Добавить();
			Движение.Период = лНачалоОтрезка;
			Движение.Подразделение = Подразделение;
			Движение.СтатьяЗатрат = ТекСтрокаСтатьиЗатрат.СтатьяЗатрат;
			Движение.СуммаПлан = СуммаПланОтрезка;
			Движение.ДопустимоеПревышение = ДопустимоеПревышениеОтрезка;
			
			СуммаКРаспределению = СуммаКРаспределению - Движение.СуммаПлан;
			ДопустимоеПревышениеКРаспределению = ДопустимоеПревышениеКРаспределению - Движение.ДопустимоеПревышение;
			
			ПериодКРаспределению = ПериодКРаспределению - ДлинаОтрезка;
			
			лНачалоОтрезка = лКонецОтрезка + 1;
			лКонецОтрезка = МИН(КонецПериода, КонецМесяца(лНачалоОтрезка));
			
		КонецЦикла;
		
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
